Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# action.approve
source: Approve
zh_hans: 批准

# action.back
source: Back
zh_hans: 返回

# action.cancel
source: Cancel
zh_hans: 取消

# action.cancel_task
source: Cancel Task
zh_hans: 取消任务

# action.close
source: Close
zh_hans: 关闭

# action.copied
source: Copied
zh_hans: 已复制

# action.copy
source: Copy
zh_hans: 复制

# action.delete
source: Delete
zh_hans: 删除

# action.deny
source: Deny
zh_hans: 拒绝

# action.disconnect
source: Disconnect
zh_hans: 断开连接

# action.done
source: Done
zh_hans: 完成

# action.emergency_stop
source: Emergency Stop
zh_hans: 紧急停止

# action.install
source: Install
zh_hans: 安装

# action.reload
source: Reload
zh_hans: 重新读取

# action.retry
source: Retry
zh_hans: 重试

# action.save
source: Save
zh_hans: 保存

# action.stop
source: Stop
zh_hans: 停止

# action.uninstall
source: Uninstall
zh_hans: 卸载

# agent.background_execution
source: How runs stay alive in the background
zh_hans: 后台执行方式

# app.app_environment.background_task_complete
source: Background task complete
zh_hans: 后台任务完成

# app.app_environment.background_task_ended
source: Background task ended: %@
zh_hans: 后台任务结束：%@

# app.floe_agent_app.archive
source: Archive
zh_hans: 归档

# app.floe_agent_app.archive_task
source: Archive Task
zh_hans: 归档任务

# app.floe_agent_app.collapse_task_list
source: Collapse task list
zh_hans: 收起任务列表

# app.floe_agent_app.creative
source: Creative
zh_hans: 创意模式

# app.floe_agent_app.delete_selected_canvas_content
source: Delete selected canvas content
zh_hans: 删除所选画布内容

# app.floe_agent_app.delete_task
source: Delete task?
zh_hans: 删除任务？

# app.floe_agent_app.delete_task_2
source: Delete task
zh_hans: 删除任务

# app.floe_agent_app.duplicate
source: Duplicate
zh_hans: 复制副本

# app.floe_agent_app.duplicate_selected_nodes
source: Duplicate selected nodes
zh_hans: 复制所选节点

# app.floe_agent_app.files
source: Files
zh_hans: 文件

# app.floe_agent_app.fit_canvas
source: Fit Canvas
zh_hans: 适合画布

# app.floe_agent_app.group
source: Group
zh_hans: 编组

# app.floe_agent_app.is_running_on_this_device_local
source: %@ is running on this device. Local models and the Linux environment cannot run at the same time: continuing stops these environments first (disk and data are preserved), or cancel this local model request.
zh_hans: 本机正在运行 %@。本地模型与 Linux 环境不能同时运行：继续将先停止这些环境（磁盘与数据会保留），或取消本次本地模型请求。

# app.floe_agent_app.linux_environments
source: %@ Linux environments
zh_hans: %@ 个 Linux 环境

# app.floe_agent_app.linux_environments_count
source: %@ Linux environments
zh_hans: %@ 个 Linux 环境

# app.floe_agent_app.local_models_and_linux_environments_cannot
source: This device is running %@. Local models and Linux environments cannot run at the same time: continuing stops these environments first (disk and data are preserved), or cancel this local model request.
zh_hans: 本机正在运行 %@。本地模型与 Linux 环境不能同时运行：继续将先停止这些环境（磁盘与数据会保留），或取消本次本地模型请求。

# app.floe_agent_app.local_services
source: %@ local services
zh_hans: %@ 个本地服务

# app.floe_agent_app.local_services_count
source: %@ local services
zh_hans: %@ 个本地服务

# app.floe_agent_app.mounting_task_workspace
source: Mounting task workspace…
zh_hans: 正在挂载任务工作区…

# app.floe_agent_app.move_to_project
source: Move to project
zh_hans: 移动到项目

# app.floe_agent_app.navigation
source: Navigation
zh_hans: 导航

# app.floe_agent_app.new_in
source: New in %@
zh_hans: 在 %@ 中新建

# app.floe_agent_app.new_regular_chat
source: New regular chat
zh_hans: 新建普通会话

# app.floe_agent_app.new_task_in
source: New task in %@
zh_hans: 在 %@ 中新建任务

# app.floe_agent_app.nudge_down
source: Nudge down
zh_hans: 向下微移

# app.floe_agent_app.nudge_left
source: Nudge left
zh_hans: 向左微移

# app.floe_agent_app.nudge_right
source: Nudge right
zh_hans: 向右微移

# app.floe_agent_app.nudge_up
source: Nudge up
zh_hans: 向上微移

# app.floe_agent_app.only_the_project_entry_in_floe
source: Only the project entry in Floe is removed; the original folder is not deleted.
zh_hans: 只移除 Floe 中的项目入口，不会删除原文件夹。

# app.floe_agent_app.open_task_list
source: Open task list
zh_hans: 打开任务列表

# app.floe_agent_app.paste_canvas_nodes
source: Paste canvas nodes
zh_hans: 粘贴画布节点

# app.floe_agent_app.redo_canvas
source: Redo Canvas
zh_hans: 画布重做

# app.floe_agent_app.rename_task
source: Rename Task
zh_hans: 重命名任务

# app.floe_agent_app.select_all_canvas_content
source: Select all canvas content
zh_hans: 选择全部画布内容

# app.floe_agent_app.select_and_move
source: Select and Move
zh_hans: 选择与移动

# app.floe_agent_app.settings
source: Settings
zh_hans: 设置

# app.floe_agent_app.stop_and_continue
source: Stop and continue
zh_hans: 停止并继续

# app.floe_agent_app.task_center
source: Task Center
zh_hans: 任务中心

# app.floe_agent_app.task_name
source: Task name
zh_hans: 任务名称

# app.floe_agent_app.the_local_model_needs_the_linux
source: The local model needs the Linux environment stopped
zh_hans: 本地模型需要停止 Linux 环境

# app.floe_agent_app.the_task_private_workspace_and_temporary
source: The task, private workspace and temporary credentials will be deleted. This cannot be undone.
zh_hans: 任务、私有工作区和临时凭据将被删除，此操作不可撤销。

# app.floe_agent_app.the_workspace_could_not_be_mounted
source: The workspace could not be mounted
zh_hans: 工作区无法挂载

# app.floe_agent_app.understand_and_organize_handwriting
source: Understand and organize handwriting
zh_hans: 理解并整理笔迹

# app.floe_agent_app.undo_canvas
source: Undo Canvas
zh_hans: 画布撤销

# app.floe_agent_app.ungroup
source: Ungroup
zh_hans: 取消编组

# app.floe_agent_app.zoom_in
source: Zoom In
zh_hans: 放大

# app.floe_agent_app.zoom_out
source: Zoom Out
zh_hans: 缩小

# approval.action
source: Action
zh_hans: 操作

# approval.evidence
source: Details & diff
zh_hans: 详情与 Diff

source: Approval required
zh_hans: 需要批准

# approval.risks
source: Risk labels
zh_hans: 风险标签

# approval.scope
source: Scope
zh_hans: 范围

# approval.scope.choose
source: Remember for
zh_hans: 授权范围

# approval.scope.host
source: This host
zh_hans: 主机

# approval.scope.once
source: Just once
zh_hans: 仅这一次

# approval.scope.project
source: This project
zh_hans: 当前项目

# approval.scope.task
source: This task
zh_hans: 本次任务

# archive.browse
source: Browse Archive
zh_hans: 浏览压缩包

# auxiliary.adapter.none
source: No configured provider currently supports image requests.
zh_hans: 当前已配置的服务商均不支持图片请求。

# auxiliary.add_model
source: Add Image Model
zh_hans: 添加图片模型

# auxiliary.editing
source: Image Editing
zh_hans: 图片编辑

# auxiliary.editing.unavailable
source: Image editing is unavailable for this provider in the current build.
zh_hans: 当前版本暂不支持此服务商的图片编辑接口。

# auxiliary.generation
source: Image Generation
zh_hans: 图片生成

# auxiliary.image.configuration
source: Image Generation
zh_hans: 生图配置

# auxiliary.image_model
source: Image Model
zh_hans: 图片模型

# auxiliary.keychain.hint
source: Image models reuse the provider's Keychain credential and stay separate from chat models.
zh_hans: 图片模型复用服务商的钥匙串凭据，并与对话模型分开管理。

# auxiliary.model_kind_hint
source: Generation/editing produce images; vision lets the model read images.
zh_hans: 生成/编辑用于产出图片；视觉输入让模型能看图。

# auxiliary.not_configured
source: Not Configured
zh_hans: 未配置

# auxiliary.provider
source: Provider
zh_hans: 服务商

# auxiliary.provider_required
source: Add a provider before creating an image model.
zh_hans: 请先添加服务商，再创建图片模型。

# auxiliary.shared.empty
source: Add a model that supports both image generation and editing.
zh_hans: 请添加同时支持图片生成和编辑的模型。

# auxiliary.shared.model
source: Shared Image Model
zh_hans: 共用图片模型

# auxiliary.shared.toggle
source: Use One Model for Generation and Editing
zh_hans: 生成与编辑共用一个模型

# auxiliary.vision.empty
source: Add a model that can understand images.
zh_hans: 请添加支持图片理解的模型。

# auxiliary.vision.reasoning
source: Enable reasoning for vision
zh_hans: 视觉识别启用思考

# auxiliary.vision.reasoning.footer
source: Off by default for faster image inspection. When enabled, Floe explicitly requests the provider's lowest reasoning level.
zh_hans: 默认关闭以加快识图；开启后会显式请求供应商支持的最低思考强度。

# background.approval.body
source: A tool call is waiting for your confirmation.
zh_hans: 有一个工具调用等待你的确认。

# background.approval.result
source: Confirmation needed: %@
zh_hans: 需要确认：%@

# background.event.approval
source: Waiting for approval
zh_hans: 等待审批

# background.event.cancelled
source: Cancelled
zh_hans: 已取消

# background.event.completed
source: Completed
zh_hans: 已完成

# background.event.failed
source: Failed
zh_hans: 运行失败

# background.linux.disk_preserved
source: %@. The disk is preserved and it can be started again.
zh_hans: %@。磁盘已保留，可再次启动。

# background.linux.service_environment_gone_detail
source: The environment is no longer running; the managed service stopped with it.
zh_hans: 环境已不再运行，托管服务随之终止。

# background.linux.service_exited_body
source: The background service exited unexpectedly.
zh_hans: 后台服务异常退出。

# background.linux.service_unexpected_stop_detail
source: The service stopped without a stop request. The guest protocol reports liveness only, so the exit reason is unknown.
zh_hans: 服务在未收到停止指令时终止；客户机协议只报告存活状态，无法得知退出原因。

# background.linux.stop_detail
source: %@; the environment stopped safely and flushed its disk. The background-running preference is preserved.
zh_hans: %@；环境已安全停止并刷新磁盘，后台运行偏好保留

# background.linux.stop_reason.pip_closed
source: Picture in Picture was closed
zh_hans: 用户关闭了画中画

# background.linux.stopped_body
source: The environment has stopped.
zh_hans: 环境已停止。

# background.linux.surface_running
source: Linux environment running
zh_hans: Linux 环境运行中

# background.pip.commands
source: Commands %@
zh_hans: 命令 %@

# background.pip.cores
source: %lld cores
zh_hans: %lld 核

# background.pip.cpu_guest
source: CPU guest %@
zh_hans: CPU 客户机 %@

# background.pip.host_thread
source: host thread %@
zh_hans: 宿主线程 %@

# background.pip.memory
source: Memory %@
zh_hans: 内存 %@

# background.pip.ports
source: Ports %@
zh_hans: 端口 %@

# background.pip.services
source: Services %@
zh_hans: 服务 %@

# background.pip.terminals
source: Terminals %@
zh_hans: 终端 %@

# background.pip_note
source: While a task runs, the picture stays inside the task or canvas toolbar. When you leave Floe, the system opens Picture-in-Picture automatically; you can also start or close it from the toolbar. No separate floating card appears while Floe is in the foreground.
zh_hans: 任务运行时，画面只嵌在任务或画布工具栏内；离开 Floe 时系统会自动进入画中画，也可在工具栏手动启动或关闭。Floe 在前台时不会出现独立悬浮卡片。

# background.pip_section
source: Picture-in-Picture status
zh_hans: 画中画状态

# background.pip_unavailable
source: Status Picture-in-Picture is not enabled in this version: choosing it uses a regular background task instead, which can resume the work when you return.
zh_hans: 此版本未启用状态画中画：选择画中画时会改用普通后台任务，并可在返回时恢复工作。

# background.run.cancelled_body
source: The task stopped; its checkpoint is preserved and it can be restarted or resumed.
zh_hans: 任务已停止，检查点已保留，可重新开始或继续。

# background.run.failure_body
source: Open the task to review and recover.
zh_hans: 打开任务查看并恢复。

# background.run.success_body
source: Open the task to see the result and checklist progress.
zh_hans: 打开任务查看结果与待办进度。

# background.settings.title
source: Background execution
zh_hans: 后台执行

# background.surface.completed_duration
source: Completed · took %@
zh_hans: 已完成 · 用时 %@

# background.surface.duration.minutes_seconds
source: %lld min %lld s
zh_hans: %lld 分 %lld 秒

# background.surface.duration.seconds
source: %lld s
zh_hans: %lld 秒

# background.task.name_fallback
source: Task
zh_hans: 任务

# background.value.unavailable
source: N/A
zh_hans: 暂无

# browser.address
source: Website address
zh_hans: 网页地址

# browser.close_tab
source: Close tab
zh_hans: 关闭标签页

# browser.new_tab
source: New tab
zh_hans: 新标签页

# browser.return_to_agent
source: Return to agent
zh_hans: 交还智能体

# browser.take_control
source: Take control
zh_hans: 接管浏览器

# browser.title
source: Browser
zh_hans: 浏览器

# canvas.artifact.action.generate
source: Generate
zh_hans: 生成

# canvas.artifact.badge.format
source: Artifact · %@
zh_hans: 产物 · %@

# canvas.artifact.import.failed.format
source: Could not import artifact: %@
zh_hans: 导入产物失败：%@

# canvas.artifact.import.files
source: Import from Files
zh_hans: 从文件导入

# canvas.artifact.import.library
source: Add Existing Material
zh_hans: 从已有素材添加

# canvas.artifact.import.partial_failed
source: Some artifacts could not be imported:
zh_hans: 部分产物导入失败：

# canvas.artifact.import.photos
source: Import from Photos
zh_hans: 从相册导入

# canvas.artifact.import.photos_partial.format
source: Imported %@ artifacts; %@ Photos items could not be read.
zh_hans: 已导入 %@ 个产物，另有 %@ 个相册项目读取失败。

# canvas.artifact.import.photos_partial.format.one
source: Imported %@ artifact; %@ Photos items could not be read.
zh_hans: 已导入 %@ 个产物，另有 %@ 个相册项目读取失败。

# canvas.artifact.origin.generated
source: Generated
zh_hans: 生成

# canvas.artifact.origin.imported
source: Imported
zh_hans: 导入

# canvas.artifact.photo_name.format
source: Photo Artifact %@
zh_hans: 相册产物-%@

# canvas.artifact.unbound
source: No artifact attached
zh_hans: 未绑定产物

# canvas.builtin.markdown_default
source: # Markdown\n\nDouble-tap to edit the content.
zh_hans: # Markdown\n\n双击编辑内容。

# canvas.connection.ai_associate
source: Continue with AI
zh_hans: AI 继续联想

# canvas.connection.auto_connect_hint
source: The new node will connect automatically
zh_hans: 新节点会自动连接

# canvas.connection.continue_from_node
source: Continue from This Node
zh_hans: 从此节点继续

# canvas.creation.section.artifacts
source: Import Artifacts
zh_hans: 导入产物

# canvas.creation.section.basic
source: Basic Nodes
zh_hans: 基础节点

# canvas.creation.section.creation
source: Creative Nodes
zh_hans: 创作节点

# canvas.drawingHistory.current
source: Current version
zh_hans: 当前版本

# canvas.drawingHistory.restore
source: Restore
zh_hans: 恢复

# canvas.generation.action.cancel
source: Cancel Generation
zh_hans: 取消生成

# canvas.generation.action.configure
source: Configure Task
zh_hans: 配置任务

# canvas.generation.action.generate_again
source: Generate Again
zh_hans: 再次生成

# canvas.generation.action.retry
source: Retry
zh_hans: 重试

# canvas.generation.action.running
source: Running
zh_hans: 执行中

# canvas.generation.action.save_configuration
source: Save Configuration
zh_hans: 保存配置

# canvas.generation.action.start
source: Start Generation
zh_hans: 开始生成

# canvas.generation.cannot_complete
source: Could Not Complete
zh_hans: 无法完成

# canvas.generation.context_prefix
source: Explicit canvas references:
zh_hans: 画布显式引用：

# canvas.generation.error.configuration_missing
source: This task has no saved generation configuration. Open Configure Task and save it first.
zh_hans: 该任务没有已保存的生成配置，请先打开“配置任务”并保存。

# canvas.generation.error.empty_image_result
source: The provider completed without returning an image. Check the model and try again.
zh_hans: 供应商已完成请求，但没有返回图片。请检查模型后重试。

# canvas.generation.error.generic
source: Generation could not be completed. Open task details to review the configuration and retry.
zh_hans: 生成未能完成，请打开任务详情检查配置后重试。

# canvas.generation.error.invalid_request
source: The provider rejected the task parameters. Update the model or generation settings and retry.
zh_hans: 供应商拒绝了任务参数，请修改模型或生成设置后重试。

# canvas.generation.error.invalid_response
source: The provider returned an incomplete result. The existing task and artifact have been preserved for retry.
zh_hans: 供应商返回的结果不完整，原任务和产物节点已保留，可直接重试。

# canvas.generation.error.request_failed
source: The remote generation service failed. Check its status or credentials, then retry this task.
zh_hans: 远程生成服务执行失败，请检查服务状态或凭据后重试当前任务。

# canvas.generation.error.video_model_missing
source: The saved video model is unavailable. Open Configure Task and choose an available model.
zh_hans: 已保存的视频模型不可用，请打开“配置任务”选择可用模型。

# canvas.generation.error.video_provider_unsupported
source: The selected provider does not support video generation. Choose a video-capable provider.
zh_hans: 当前供应商不支持视频生成，请选择支持视频的供应商。

# canvas.generation.failed.reconfigure
source: Generation failed. Select this task to configure and retry.
zh_hans: 生成失败，选中后重新配置

# canvas.generation.prepare_failed
source: Could not prepare the generation task.
zh_hans: 无法准备生成任务。

# canvas.generation.progress.cancelled
source: Task cancelled
zh_hans: 任务已取消

# canvas.generation.progress.completed
source: Generation complete; preparing download
zh_hans: 生成完成，正在准备下载

# canvas.generation.progress.downloading
source: Downloading; it will be added to Materials automatically
zh_hans: 正在下载，完成后会自动加入素材库

# canvas.generation.progress.expired
source: The result may have expired. Confirm billing before generating again.
zh_hans: 结果可能已过期，可确认计费后重新生成

# canvas.generation.progress.failed.format
source: Generation failed: %@
zh_hans: 生成失败：%@

# canvas.generation.progress.preparing
source: Preparing generation task
zh_hans: 正在准备生成任务

# canvas.generation.progress.ready
source: Saved to Materials
zh_hans: 已保存到素材库

# canvas.generation.progress.running
source: Generating
zh_hans: 正在生成

# canvas.generation.progress.submitted
source: Submitted; waiting for the provider
zh_hans: 已提交，等待供应商开始

# canvas.generation.running.detail
source: The task and artifact cards will stay in sync. You can cancel this attempt without creating another artifact node.
zh_hans: 任务卡与产物卡会同步显示进度；可取消本次尝试，且不会新增产物节点。

# canvas.generation.running.title
source: Generating
zh_hans: 正在生成

# canvas.generation.save_footer
source: Saving only configures the task. Start it explicitly from the task card.
zh_hans: 保存只会配置任务；请回到任务卡片明确点击开始生成。

# canvas.generation.state.cancelled
source: Cancelled
zh_hans: 已取消

# canvas.generation.state.completed
source: Processing Result
zh_hans: 处理结果

# canvas.generation.state.configuration_needed
source: Configure
zh_hans: 待配置

# canvas.generation.state.configured
source: Ready to Start
zh_hans: 已配置

# canvas.generation.state.downloading
source: Downloading
zh_hans: 下载中

# canvas.generation.state.expired
source: Expired
zh_hans: 已过期

# canvas.generation.state.failed
source: Failed
zh_hans: 失败

# canvas.generation.state.preparing
source: Preparing
zh_hans: 准备中

# canvas.generation.state.ready
source: Done
zh_hans: 完成

# canvas.generation.state.running
source: Generating
zh_hans: 生成中

# canvas.generation.state.submitted
source: Queued
zh_hans: 已排队

# canvas.generation.state.uploading
source: Uploading References
zh_hans: 正在上传参考图

# canvas.node.basic_card
source: Basic Card
zh_hans: 基础卡片

# canvas.node.card
source: Card
zh_hans: 卡片

# canvas.node.create
source: Create Node
zh_hans: 新建节点

# canvas.node.group
source: Group
zh_hans: 分组

# canvas.node.panorama_3d
source: 3D Panorama
zh_hans: 3D 全景

# canvas.node.scene_3d
source: 3D Scene
zh_hans: 3D 场景

# canvas.node.shape
source: Shape
zh_hans: 形状

# canvas.node.sticky_note
source: Sticky Note
zh_hans: 便签

# canvas.node.text
source: Text
zh_hans: 文本

# canvas.node_ai.applied
source: Changes applied to this node
zh_hans: 已更新当前节点

# canvas.node_ai.applying
source: Validating and applying changes…
zh_hans: 正在校验并应用修改…

# canvas.node_ai.empty_change
source: The model returned no usable node change.
zh_hans: 模型没有返回可用的节点修改。

# canvas.node_ai.invalid_response
source: The node edit response was not valid structured data.
zh_hans: 节点编辑结果不是有效的结构化数据。

# canvas.node_ai.no_model
source: Configure a Canvas Assistant model before using node AI.
zh_hans: 请先配置画布助手模型，再使用节点 AI。

# canvas.node_ai.node_missing
source: This node no longer exists.
zh_hans: 当前节点已不存在。

# canvas.node_ai.response_too_large
source: The node edit response was too large.
zh_hans: 节点编辑结果过大。

# canvas.node_ai.understanding
source: Understanding this node…
zh_hans: 正在理解当前节点…

# canvas.onboarding.ai.detail
source: The small AI field edits only the selected node. It refines content and compatible settings without opening Canvas Assistant or starting a task.
zh_hans: 节点下方的小 AI 输入框只修改当前节点：整理内容和兼容参数，不打开画布助手，也不自动执行任务。

# canvas.onboarding.ai.title
source: Refine in Place
zh_hans: 在节点原位完善

# canvas.onboarding.close
source: Close
zh_hans: 关闭

# canvas.onboarding.connect.detail
source: Drag a node port to another node. Targets snap into place; release on empty space to create and connect a new node.
zh_hans: 从节点连接点拖向另一个节点即可磁吸连接；拖到空白处可快速新建并自动连接。

# canvas.onboarding.connect.title
source: Connect the Flow
zh_hans: 连接构思流程

# canvas.onboarding.finish
source: Start Creating
zh_hans: 开始创作

# canvas.onboarding.navigate.detail
source: Drag empty space with one finger to pan. Drag a node to move it. Two fingers always pan and zoom; Apple Pencil draws.
zh_hans: 单指拖动空白处平移画布，拖动节点移动节点；双指随时平移缩放，Apple Pencil 用于绘制。

# canvas.onboarding.navigate.title
source: Move Naturally
zh_hans: 自然移动画布

# canvas.onboarding.next
source: Next
zh_hans: 下一步

# canvas.onboarding.nodes.detail
source: Double-tap empty space to create. Double-tap content to edit it. Import artifacts from Files, Photos, or Materials.
zh_hans: 双击空白处新建，双击内容节点编辑；产物可从文件、相册或素材库导入。

# canvas.onboarding.nodes.title
source: Create and Edit
zh_hans: 新建与编辑节点

# canvas.onboarding.replay
source: Canvas Guide
zh_hans: 画布入门

# canvas.onboarding.run.detail
source: Save task settings first, then press Start Generation on the task card. The task and artifact cards show progress and retry in place.
zh_hans: 先保存任务配置，再在任务卡点击开始生成；任务卡和产物卡都会显示进度，并支持原位重试。

# canvas.onboarding.run.title
source: Start When Ready
zh_hans: 准备好再开始

# canvas.onboarding.title
source: Canvas Basics
zh_hans: 画布基础操作

# canvas.task.generation
source: Generation Task
zh_hans: 生成任务

# chat.add_provider
source: Add Provider
zh_hans: 添加提供商

# chat.add_provider.hint
source: Add a model provider to start chatting.
zh_hans: 添加模型提供商后即可开始对话。

# chat.approval_card_view.run_python_code_on_this_device
source: Run Python code on this device
zh_hans: 运行设备上的 Python 代码

# chat.approval_card_view.this_creates_a_skill_saved_to
source: This creates a skill saved to the skill library, available to all tasks afterward. Approving confirms the save.
zh_hans: 此操作会创建一个技能并保存到技能库，之后对所有任务可用。批准即确认保存。

# chat.assistant_message_view.read_aloud
source: Read aloud
zh_hans: 朗读

# chat.assistant_message_view.save_to_notes
source: Save to Notes
zh_hans: 保存到手记

# chat.assistant_message_view.stop_reading
source: Stop reading
zh_hans: 停止朗读

# chat.composer_draft_store.not_kept
source: Not kept
zh_hans: 未保留

# chat.composer_draft_store.the_draft_file_could_not_be
source: The draft file could not be read (copy %@ kept): %@
zh_hans: 草稿文件无法读取（已保留副本 %@）：%@

# chat.composer_draft_store.the_draft_key_is_not_a
source: The draft key is not a conversation UUID: %@
zh_hans: 草稿键不是会话 UUID：%@

# chat.context_usage.pending
source: Waiting for model usage
zh_hans: 等待模型返回用量

# chat.conversation_batch_management_view.delete_the_selected_tasks
source: Delete the %@ selected tasks?
zh_hans: 删除所选的 %@ 个任务？

# chat.conversation_batch_management_view.deselect_all
source: Deselect all
zh_hans: 取消全选

# chat.conversation_batch_management_view.no_matching_tasks
source: No matching tasks
zh_hans: 没有匹配的任务

# chat.conversation_batch_management_view.search_titles_and_conversation_content
source: Search titles and conversation content
zh_hans: 搜索标题与对话内容

# chat.conversation_batch_management_view.searching_conversations
source: Searching conversations…
zh_hans: 正在搜索对话内容…

# chat.conversation_batch_management_view.select_tasks
source: Select tasks
zh_hans: 选择任务

# chat.conversation_batch_management_view.selected
source: %@ selected
zh_hans: 已选 %@

# chat.conversation_batch_management_view.stop_and_archive
source: Stop and archive
zh_hans: 停止并归档

# chat.conversation_batch_management_view.stop_and_archive_the_selected_tasks
source: Stop and archive the selected tasks?
zh_hans: 停止运行并归档所选任务？

# chat.conversation_batch_management_view.the_selected_task_is_still_running
source: The selected task is still running. Archiving stops execution first; it can be restored from the archive later.
zh_hans: 所选任务仍在运行。归档会先停止执行，之后可从归档区恢复。

# chat.conversation_batch_management_view.the_task_and_its_private_workspace
source: The task and its private workspace will be deleted; shared project files are kept. This cannot be undone.
zh_hans: 任务及其私有工作区将被删除，共享项目文件保留。此操作不可撤销。
